package oop.Constructor;

public class Constructor {
    /*
    Конструктор — бул класстын атайын методу, ал объект жаралганда автоматтык түрдө чакырылат.
    Негизги максаты:
    Объект жаралып жатканда талааларга баштапкы маанилерди берүү (инициализация кылуу).
    Конструктордун өзгөчөлүктөрү:
    Класстын аты менен бирдей аталышы керек
    Return type (мисалы: void, int) болбойт
    Бир нече конструктор болушу мүмкүн (overloading)
    Эмне үчүн конструктор маанилүү?
    Объект түзүлөрү менен талааларды автоматтык түрдө толтурат
    Кодду кыскартат жана жеңилдетет
    Жаңы объекттерди тез жана так түзүүгө жардам берет
     */
}
